robsanchez3/03_bootloader/STM32CubeIDE/Src/main.c
/**
  * @file   main.c
  * @brief  O3 Bootloader
  *
  *  Behaviour:
  *    1. Minimal HW init (clocks, GPIO).
  *    2. Perform a silent USB boot check at power-on.
  *    3. If a ready update drive is found, run the update flow.
  *    4. Otherwise jump to the application if valid, or enter recovery.
  */

#include "stm32u5xx_hal.h"
#include "main.h"
#include "boot_jump.h"
#include "boot_flash.h"
#include "boot_ospi.h"
#include "boot_display.h"
#include "boot_crc.h"
#include "boot_manifest.h"
#include "usb_msc_service.h"
#include "usb_fs_service.h"
#include "ff.h"
#include <stdio.h>
#include <string.h>


/* -----------------------------------------------------------------------
 * Private function prototypes
 * ----------------------------------------------------------------------- */
static void SystemPower_Config(void);
static void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void Recovery_Loop(void);
static void Boot_SelectBootPath(void);
static void Boot_SelectAppOrRecovery(void);
static void FlashAppInt(uint32_t expected_crc32);
static void FlashAppOspi(uint32_t expected_crc32);
static void UsbProcessUpdate(void);
static uint8_t UsbBootCheck(uint32_t detect_timeout_ms, uint32_t ready_timeout_ms);
static void BootDisplay_EnsureInit(void);
static void Boot_ShowCountdown(uint32_t row0,
                               const char *line0,
                               uint32_t row1,
                               const char *line1,
                               uint32_t row2,
                               BootDisplayColor_t color);
static void Boot_ShowApplicationLaunchCountdown(void);
static void Boot_ShowProgrammingCountdown(const char *ver_line, const char *build_date);
static void BootDisplay_UpdateProgress(const char *label, uint32_t current, uint32_t total);
static void BootDisplay_Fail(const char *message, uint8_t clear_progress);
static void BootDisplay_FlashEraseProgress(uint32_t current, uint32_t total);
static void BootDisplay_OspiEraseProgress(uint32_t current, uint32_t total);

#define BOOT_FORCE_INVALID_APP_FOR_TEST   0U
#define BOOT_USB_UPDATE_ENABLED           1U
#define BOOT_USB_DETECT_TIMEOUT_MS        1800U
#define BOOT_USB_READY_TIMEOUT_MS         2500U

#define USB_UPDATE_DIR_PATH               "0:/UPDATE"
#define USB_UPDATE_APP_INT_BIN            "0:/UPDATE/app_int.bin"
#define USB_UPDATE_APP_OSPI_BIN           "0:/UPDATE/app_ospi.bin"
#define USB_UPDATE_MANIFEST               "0:/UPDATE/manifest.ini"

/* Chunked read configuration */
#define CHUNKED_READ_BLOCK_SIZE           1048576U /* bytes per open/read/close cycle */
#define CHUNKED_READ_MAX_RETRIES          20U      /* retries per block on failure    */
#define CHUNKED_READ_INTER_BLOCK_DELAY_MS 500U     /* pause between blocks            */

/* Single shared IO buffer — used by FlashAppInt and FlashAppOspi.
 * These functions never run concurrently so one buffer is sufficient. */
static uint8_t io_buf[CHUNKED_READ_BLOCK_SIZE];
static uint8_t boot_display_initialized;

int _write(int file, char *ptr, int len)
{
    int i;

    (void)file;

    for (i = 0; i < len; i++)
    {
        ITM_SendChar(*ptr++);
    }

    return len;
}


static void BootDisplay_EnsureInit(void)
{
    if (boot_display_initialized == 0U)
    {
        BootDisplay_Init();
        boot_display_initialized = 1U;
    }
}

/* -----------------------------------------------------------------------
 * UsbBootCheck — Silent power-on USB check used to decide whether the
 *                bootloader update flow should run.
 * ----------------------------------------------------------------------- */
static uint8_t UsbBootCheck(uint32_t detect_timeout_ms, uint32_t ready_timeout_ms)
{
    uint32_t start = HAL_GetTick();
    UsbMscState_t state;

    UsbMscService_Init();
    UsbMscService_SetEnabled(1U);
    UsbFsService_Init();

    while ((HAL_GetTick() - start) < detect_timeout_ms)
    {
        UsbMscService_Process();
        state = UsbMscService_GetState();

        if (state == USB_MSC_STATE_READY)
        {
            return 1U;
        }

        if ((state == USB_MSC_STATE_DEVICE_CONNECTED) ||
            (state == USB_MSC_STATE_ENUMERATING))
        {
            uint32_t connected_start = HAL_GetTick();

            while ((HAL_GetTick() - connected_start) < ready_timeout_ms)
            {
                UsbMscService_Process();
                state = UsbMscService_GetState();

                if (state == USB_MSC_STATE_READY)
                {
                    return 1U;
                }

                if ((state == USB_MSC_STATE_IDLE) || (state == USB_MSC_STATE_OFF))
                {
                    break;
                }
            }

            break;
        }
    }

    UsbFsService_Unmount();
    UsbMscService_SetEnabled(0U);
    return 0U;
}

static void BootDisplay_UpdateProgress(const char *label, uint32_t current, uint32_t total)
{
    uint32_t shown;

    if (total == 0U)
    {
        BootDisplay_ShowProgress(label, 0U, 1U);
        return;
    }

    shown = current;
    if (shown > total)
    {
        shown = total;
    }

    BootDisplay_ShowProgress(label, shown, total);
}

static void BootDisplay_Fail(const char *message, uint8_t clear_progress)
{
    BootDisplay_LogColor(message, BOOT_DISPLAY_COLOR_RED);
    if (clear_progress != 0U)
    {
        BootDisplay_ClearProgress();
    }
}

static void Boot_ShowCountdown(uint32_t row0,
                               const char *line0,
                               uint32_t row1,
                               const char *line1,
                               uint32_t row2,
                               BootDisplayColor_t color)
{
    uint32_t elapsed;
    uint32_t duration = 30U;
    char line[32];
    char bar[11];
    uint32_t i;

    BootDisplay_ClearLine(row0);
    BootDisplay_ClearLine(row1);
    BootDisplay_ClearLine(row2);
    BootDisplay_WriteLineColor(row0, line0, color);
    if ((line1 != NULL) && (line1[0] != '\0'))
    {
        BootDisplay_WriteLineColor(row1, line1, color);
    }

    for (elapsed = 0U; elapsed <= duration; elapsed++)
    {
        uint32_t remaining = duration - elapsed;
        uint32_t percent = (elapsed * 100U) / duration;
        uint32_t filled = 10U - (percent / 10U);

        for (i = 0U; i < 10U; i++)
        {
            bar[i] = (i < filled) ? '#' : '.';
        }
        bar[10] = '\0';

        (void)snprintf(line, sizeof(line), "[%s] %2lus",
                       bar,
                       (unsigned long)remaining);
        BootDisplay_WriteLineColor(row2, line, color);

        if (elapsed < duration)
        {
            HAL_Delay(1000U);
        }
    }
}

