robsanchez3/03_bootloader/STM32CubeIDE/Src/main.c
static void Boot_ShowApplicationLaunchCountdown(void)
{
    BootDisplay_LogColor("UPDATE COMPLETE", BOOT_DISPLAY_COLOR_GREEN);
    BootDisplay_ClearProgress();
    Boot_ShowCountdown(28U,
                       "STARTING APPLICATION...",
                       29U,
                       "",
                       29U,
                       BOOT_DISPLAY_COLOR_YELLOW);

    BootDisplay_ClearProgress();
    BootDisplay_LogColor("STARTING APPLICATION...", BOOT_DISPLAY_COLOR_GREEN);
    while (1) {} /* TEMPORARY: keep final bootloader screen visible for tests */
}

static void Boot_ShowProgrammingCountdown(const char *ver_line, const char *build_date)
{
    BootDisplay_ClearLine(26U);
    BootDisplay_WriteLineColor(26U, ver_line, BOOT_DISPLAY_COLOR_YELLOW);
    BootDisplay_ClearLine(27U);
    BootDisplay_WriteLineColor(27U, build_date, BOOT_DISPLAY_COLOR_YELLOW);
    Boot_ShowCountdown(25U,
                       "PROGRAMMING STARTS IN 30s",
                       28U,
                       "POWER OFF & REMOVE USB TO SKIP",
                       29U,
                       BOOT_DISPLAY_COLOR_YELLOW);
    BootDisplay_ClearLine(25U);
    BootDisplay_ClearLine(26U);
    BootDisplay_ClearLine(27U);
    BootDisplay_ClearLine(28U);
    BootDisplay_ClearLine(29U);
}

static void BootDisplay_FlashEraseProgress(uint32_t current, uint32_t total)
{
    BootDisplay_ShowProgress("ERASING INT FLASH...", current, total);
}

static void BootDisplay_OspiEraseProgress(uint32_t current, uint32_t total)
{
    BootDisplay_ShowProgress("ERASING OSPI FLASH...", current, total);
}

/* -----------------------------------------------------------------------
 * USB read helper: read a chunk with full USB restart recovery on failure.
 * ----------------------------------------------------------------------- */
static UsbFsResult_t UsbReadChunkWithRecovery(const char *path,
                                               uint8_t *buf,
                                               uint32_t offset,
                                               uint32_t to_read,
                                               uint32_t *bytes_read,
                                               const char *tag)
{
    UsbFsResult_t result;
    uint32_t retry;

    *bytes_read = 0U;
    for (retry = 0U; retry <= CHUNKED_READ_MAX_RETRIES; retry++)
    {
        result = UsbFsService_ReadFile(path, buf, offset, to_read, bytes_read);
        if (result == USB_FS_RESULT_OK)
        {
            return USB_FS_RESULT_OK;
        }
        if (retry < CHUNKED_READ_MAX_RETRIES)
        {
            printf("[%s] read offset=%lu RETRY %lu/%u -> recovery\n",
                   tag,
                   (unsigned long)offset,
                   (unsigned long)(retry + 1U),
                   (unsigned int)CHUNKED_READ_MAX_RETRIES);

            UsbFsService_Unmount();
            UsbMscService_ForceRestart();
            {
                uint32_t t_wait = HAL_GetTick();
                while (UsbMscService_IsReady() == 0U)
                {
                    UsbMscService_Process();
                    if ((HAL_GetTick() - t_wait) > 10000U)
                    {
                        printf("[%s] recovery timeout\n", tag);
                        break;
                    }
                }
            }
            if (UsbMscService_IsReady() != 0U)
            {
                (void)UsbFsService_Mount();
            }
        }
    }

    return result;
}

/* -----------------------------------------------------------------------
 * main
 * ----------------------------------------------------------------------- */
int main(void)
{
    HAL_Init();
    __HAL_RCC_PWR_CLK_ENABLE();
    SystemPower_Config();
    if (HAL_PWREx_ControlVoltageScaling(PWR_REGULATOR_VOLTAGE_SCALE2) != HAL_OK)
    {
        Error_Handler();
    }
    SystemClock_Config();
    MX_GPIO_Init();

    printf("BL start\n");
    Boot_SelectBootPath();

    while (1) {}
}

/* -----------------------------------------------------------------------
 * Recovery_Loop
 * ----------------------------------------------------------------------- */
static void Recovery_Loop(void)
{
    uint32_t last_blink = HAL_GetTick();

    BootDisplay_EnsureInit();
    BootDisplay_Log("RECOVERY MODE");
    BootDisplay_Log("NO VALID APP");

    while (1)
    {
        if ((HAL_GetTick() - last_blink) >= 250U)
        {
            last_blink = HAL_GetTick();
            HAL_GPIO_TogglePin(BOOT_LED_GPIO_Port, BOOT_LED_Pin);
        }
    }
}

/* -----------------------------------------------------------------------
 * Boot_SelectBootPath
 * ----------------------------------------------------------------------- */
static void Boot_SelectBootPath(void)
{
#if BOOT_USB_UPDATE_ENABLED
    if (UsbBootCheck(BOOT_USB_DETECT_TIMEOUT_MS, BOOT_USB_READY_TIMEOUT_MS) != 0U)
    {
        BootDisplay_EnsureInit();
        BootDisplay_Log("");
        BootDisplay_LogColor("BOOT START", BOOT_DISPLAY_COLOR_BLUE);
        UsbProcessUpdate();
        return;
    }
#endif

    Boot_SelectAppOrRecovery();
}

/* -----------------------------------------------------------------------
 * Boot_SelectAppOrRecovery
 * ----------------------------------------------------------------------- */
static void Boot_SelectAppOrRecovery(void)
{
    uint8_t app_valid = (uint8_t)Boot_IsApplicationValid(APP_BASE);

#if BOOT_FORCE_INVALID_APP_FOR_TEST
    printf("[BOOT] TEST MODE: forcing application invalid\n");
    app_valid = 0U;
#endif

    if (app_valid != 0U)
    {
        UsbFsService_Unmount();
        UsbMscService_SetEnabled(0U);
        HAL_Delay(50U);
        printf("[BOOT] Valid app found -> jump\n");
        Boot_JumpToApplication(APP_BASE);
    }

    BootDisplay_EnsureInit();
    BootDisplay_Log("APP INVALID");
    BootDisplay_Log("ENTER RECOVERY");
    printf("[BOOT] No valid app -> recovery loop\n");
    Recovery_Loop();
}

/* -----------------------------------------------------------------------
 * FlashAppInt — Read app_int.bin from USB, program internal flash, verify.
 * ----------------------------------------------------------------------- */
static void FlashAppInt(uint32_t expected_crc32)
{
    uint8_t * const chunk = io_buf;
    UsbFsResult_t  result;
    BootFlashResult_t flash_result;
    uint32_t       file_size = 0U;
    uint32_t       offset    = 0U;
    uint32_t       bytes_read;
    uint32_t       to_read;
    uint32_t       t_start;

