robsanchez3/03_bootloader/STM32CubeIDE/Src/main.c
    if (all_present == 0U)
    {
        BootDisplay_Fail("UPDATE FILES MISSING", 0U);
        printf("[UPDATE] one or more files missing\n");
        return;
    }

    printf("[UPDATE] all files present\n");
    BootDisplay_Log("ALL FILES FOUND");
    BootDisplay_Log("READING MANIFEST...");

    /* Parse manifest and validate its integrity CRC */
    mresult = BootManifest_LoadAndParse(USB_UPDATE_MANIFEST, &manifest);
    if (mresult != BOOT_MANIFEST_OK)
    {
        const char *err_msg = "MANIFEST ERROR";
        if (mresult == BOOT_MANIFEST_ERR_INTEGRITY)
            err_msg = "MANIFEST CRC FAILED";
        else if (mresult == BOOT_MANIFEST_ERR_PARSE)
            err_msg = "MANIFEST PARSE FAILED";
        else if (mresult == BOOT_MANIFEST_ERR_READ)
            err_msg = "MANIFEST READ FAILED";

        BootDisplay_Fail(err_msg, 0U);
        printf("[UPDATE] manifest error=%u\n", (unsigned int)mresult);
        return;
    }

    BootManifest_Print(&manifest);
    BootDisplay_Log("MANIFEST OK");

    /* Display version info — strip trailing _x suffix (e.g. V1.R1.P1_b -> V1.R1.P1) */
    {
        char sw_short[20];
        char lib_short[20];
        char *p;

        strncpy(sw_short, manifest.sw_version, sizeof(sw_short) - 1U);
        sw_short[sizeof(sw_short) - 1U] = '\0';
        p = strrchr(sw_short, '_');
        if (p != NULL) *p = '\0';

        strncpy(lib_short, manifest.o3_lib_version, sizeof(lib_short) - 1U);
        lib_short[sizeof(lib_short) - 1U] = '\0';
        p = strrchr(lib_short, '_');
        if (p != NULL) *p = '\0';

        {
            char log_line[32];
            (void)snprintf(log_line, sizeof(log_line), "SW: %s", sw_short);
            BootDisplay_LogColor(log_line, BOOT_DISPLAY_COLOR_BLUE);
            (void)snprintf(log_line, sizeof(log_line), "LIB: %s", lib_short);
            BootDisplay_LogColor(log_line, BOOT_DISPLAY_COLOR_BLUE);
        }

        (void)snprintf(ver_line, sizeof(ver_line), "SW: %s - LIB: %s",
                       sw_short, lib_short);
    }

    /* Validate file sizes against manifest */
    if (UsbFsService_GetFileSize(USB_UPDATE_APP_INT_BIN, &fsize_tmp) == USB_FS_RESULT_OK)
    {
        printf("[UPDATE] %s size=%lu bytes\n", USB_UPDATE_APP_INT_BIN, (unsigned long)fsize_tmp);
        if (fsize_tmp != manifest.app_int.size)
        {
            BootDisplay_Fail("INT FILE SIZE MISMATCH", 0U);
            printf("[UPDATE] expected=%lu actual=%lu\n",
                   (unsigned long)manifest.app_int.size, (unsigned long)fsize_tmp);
            return;
        }
    }
    if (UsbFsService_GetFileSize(USB_UPDATE_APP_OSPI_BIN, &fsize_tmp) == USB_FS_RESULT_OK)
    {
        printf("[UPDATE] %s size=%lu bytes\n", USB_UPDATE_APP_OSPI_BIN, (unsigned long)fsize_tmp);
        if (fsize_tmp != manifest.app_ospi.size)
        {
            BootDisplay_Fail("OSPI FILE SIZE MISMATCH", 0U);
            printf("[UPDATE] expected=%lu actual=%lu\n",
                   (unsigned long)manifest.app_ospi.size, (unsigned long)fsize_tmp);
            return;
        }
    }

    {
        char date_upper[32];
        uint32_t di;

        strncpy(date_upper, manifest.build_date, sizeof(date_upper) - 1U);
        date_upper[sizeof(date_upper) - 1U] = '\0';
        for (di = 0U; date_upper[di] != '\0'; di++)
        {
            if ((date_upper[di] >= 'a') && (date_upper[di] <= 'z'))
            {
                date_upper[di] = date_upper[di] - ('a' - 'A');
            }
        }
        Boot_ShowProgrammingCountdown(ver_line, date_upper);
    }

    /* Program both flashes and jump */
    FlashAppInt(manifest.app_int.crc32);
    FlashAppOspi(manifest.app_ospi.crc32);
}

/* -----------------------------------------------------------------------
 * SystemPower_Config
 * ----------------------------------------------------------------------- */
static void SystemPower_Config(void)
{
    if (HAL_PWREx_ConfigSupply(PWR_LDO_SUPPLY) != HAL_OK)
    {
        Error_Handler();
    }
}

/* -----------------------------------------------------------------------
 * SystemClock_Config
 * ----------------------------------------------------------------------- */
static void SystemClock_Config(void)
{
    RCC_OscInitTypeDef RCC_OscInitStruct = {0};
    RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

    RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI | RCC_OSCILLATORTYPE_HSE;
    RCC_OscInitStruct.HSIState       = RCC_HSI_ON;
    RCC_OscInitStruct.HSEState       = RCC_HSE_ON;
    RCC_OscInitStruct.PLL.PLLState   = RCC_PLL_ON;
    RCC_OscInitStruct.PLL.PLLSource  = RCC_PLLSOURCE_HSE;
    RCC_OscInitStruct.PLL.PLLMBOOST  = RCC_PLLMBOOST_DIV2;
    RCC_OscInitStruct.PLL.PLLM       = 5;
    RCC_OscInitStruct.PLL.PLLN       = 64;
    RCC_OscInitStruct.PLL.PLLP       = 10;
    RCC_OscInitStruct.PLL.PLLQ       = 2;
    RCC_OscInitStruct.PLL.PLLR       = 2;
    RCC_OscInitStruct.PLL.PLLRGE     = RCC_PLLVCIRANGE_0;
    RCC_OscInitStruct.PLL.PLLFRACN   = 0;
    if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
    {
        Error_Handler();
    }

    RCC_ClkInitStruct.ClockType      = RCC_CLOCKTYPE_HCLK  | RCC_CLOCKTYPE_SYSCLK |
                                       RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2  |
                                       RCC_CLOCKTYPE_PCLK3;
    RCC_ClkInitStruct.SYSCLKSource   = RCC_SYSCLKSOURCE_HSI;
    RCC_ClkInitStruct.AHBCLKDivider  = RCC_SYSCLK_DIV1;
    RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;
    RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;
    RCC_ClkInitStruct.APB3CLKDivider = RCC_HCLK_DIV1;
    if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_0) != HAL_OK)
    {
        Error_Handler();
    }
}

/* -----------------------------------------------------------------------
 * MX_GPIO_Init
 * ----------------------------------------------------------------------- */
static void MX_GPIO_Init(void)
{
    GPIO_InitTypeDef GPIO_InitStruct = {0};

    __HAL_RCC_GPIOI_CLK_ENABLE();
    __HAL_RCC_GPIOB_CLK_ENABLE();

    HAL_GPIO_WritePin(FS_PW_SW_GPIO_Port, FS_PW_SW_Pin, GPIO_PIN_SET);
    GPIO_InitStruct.Pin   = FS_PW_SW_Pin;
    GPIO_InitStruct.Mode  = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Pull  = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
    HAL_GPIO_Init(FS_PW_SW_GPIO_Port, &GPIO_InitStruct);

    HAL_GPIO_WritePin(BOOT_LED_GPIO_Port, BOOT_LED_Pin, GPIO_PIN_RESET);
    GPIO_InitStruct.Pin   = BOOT_LED_Pin;
    GPIO_InitStruct.Mode  = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Pull  = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
    HAL_GPIO_Init(BOOT_LED_GPIO_Port, &GPIO_InitStruct);
}

/* -----------------------------------------------------------------------
 * Error_Handler
 * ----------------------------------------------------------------------- */
void Error_Handler(void)
{
    __disable_irq();
    while (1) {}
}
